_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ИсполнителиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ИсполнителиДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтороннийПеревозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_СтатусыЗаказаНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_СтатусыЗаказаНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗаказНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ЗаказНаПеревозку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ДанныеДоставки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыЗаказаНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ИсполнителиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправленияЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/УСОERP_МатериальноТехническоеОбеспечениеКлиент/Ext/Module.bsl
#Область ПодключаемыеОбработчикиКомандФорм

// Обработка подключаемой команды "Показывать все заказы" для документа "Заказ на внутреннее потребление"
//
// Параметры:
// Форма - форма, из обработчика события которой происходит вызов команды.
// Команда - команда формы, которая вызвана.
// ДополнительныеПараметры - структура с дополнительными параметрами (по умолчанию = Неопределено).
//	
Процедура Подключаемый_УСОERP_ПоказатьВсеЗаказыВключаяПоУСО(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	ИмяКоманды = Команда.Имя;
	КнопкаФормы = Форма.Элементы[ИмяКоманды];
	КнопкаФормы.Пометка = Не КнопкаФормы.Пометка;
	
	ИсключатьДокументыПоПлануПотребностиМатериалов =  Не КнопкаФормы.Пометка;
		
	МассивДокументов = УСОERP_МатериальноТехническоеОбеспечение.ПолучитьМассивЗаказовПоПланамПотребностейВМатериалах(); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "Ссылка", МассивДокументов,
	 				ВидСравненияКомпоновкиДанных.НеВСписке, , ИсключатьДокументыПоПлануПотребностиМатериалов);
					
КонецПроцедуры

// Обработка подключаемой команды "Затраты на доставку" для документа "Поступление услуг и прочих активов"
//
// Параметры:
// Форма - форма, из обработчика события которой происходит вызов команды.
// Команда - команда формы, которая вызвана.
// ДополнительныеПараметры - структура с дополнительными параметрами (по умолчанию = Неопределено).
//	
Процедура Подключаемый_УСОERP_ЗатратыНаДоставку(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.УСОERP_ИсполнителиДоставки.СтороннийПеревозчик"));
	
	ДопустимыеСтатусы = Новый Массив;
	ДопустимыеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.ВРаботе"));
	ДопустимыеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Подготовлен"));
	ДопустимыеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Согласован"));
	
	ДопустимыеИсполнители = Новый Массив;
	ДопустимыеИсполнители.Добавить(ПредопределенноеЗначение("Перечисление.УСОERP_ИсполнителиДоставки.СтороннийПеревозчик"));

	ПараметрыФормы.Вставить("ОтборПоСтатусу", ДопустимыеСтатусы);
	ПараметрыФормы.Вставить("ОтборПоВидуОперации", ДопустимыеИсполнители);
	
	мДополнительныеПараметры = Новый Структура();
	мДополнительныеПараметры.Вставить("Форма", Форма);
	ФормаВыбора = ОткрытьФорму("Документ.УСОERP_ЗаказНаПеревозку.ФормаВыбора",ПараметрыФормы, Форма,,,,Новый ОписаниеОповещения("Подключаемый_ОбработкаВыбораЗатратНаДоставку", УСОERP_МатериальноТехническоеОбеспечениеКлиент,мДополнительныеПараметры));
	
КонецПроцедуры

Процедура Подключаемый_ОбработкаВыбораЗатратНаДоставку(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;

	мДополнительныеПараметры = Новый Структура;
		
	мДополнительныеПараметры.Вставить("Объект", ДополнительныеПараметры.Форма.Объект);
	УСОERP_МатериальноТехническоеОбеспечение.Подключаемый_ОбработкаВыбораЗатратНаДоставкуНаСервере(РезультатЗакрытия, мДополнительныеПараметры);
	
	Если мДополнительныеПараметры.Свойство("СоответствиеТаблицыРасходов") Тогда
		
		СоответствиеТаблицыРасходов = мДополнительныеПараметры.СоответствиеТаблицыРасходов;
		РасходыДокумента = ДополнительныеПараметры.Форма.Объект.Расходы;
		РасходыДокумента.Очистить();
		Для Каждого мСтрокаРасход Из СоответствиеТаблицыРасходов Цикл
			НоваяСтрока = РасходыДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, мСтрокаРасход.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_ДоставкаПриИзменении(Форма, ЗначениеРеквизита) Экспорт
	
	Элемент_АдресОтправления = Форма.элементы.Найти("УСОERP_АдресОтправления");
	Если НЕ Элемент_АдресОтправления = Неопределено Тогда
		Элемент_АдресОтправления.Доступность = ЗначениеРеквизита;
		Если ЗначениеРеквизита = Ложь Тогда
			Форма.Объект.УСОERP_АдресОтправления = ПредопределенноеЗначение("Справочник.УСОERP_ШаблоныАдресов.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Элемент_АдресДоставки = Форма.элементы.Найти("УСОERP_АдресДоставки");
	Если НЕ Элемент_АдресДоставки = Неопределено Тогда
		Элемент_АдресДоставки.Доступность = ЗначениеРеквизита;
		Если ЗначениеРеквизита = Ложь Тогда
			Форма.Объект.УСОERP_АдресДоставки = ПредопределенноеЗначение("Справочник.УСОERP_ШаблоныАдресов.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ПрограммныйИнтерфейс

// Обработка проверки перода
//
// Параметры:
// Форма 							- форма, из обработчика события которой происходит вызов команды.
// ИмяКроссТаблицы 					- наименование элемента формы.
// ОповещениеОбновленияИнтерфейса 	- текст оповещениния.
//	
Процедура ПриИзмененииПериодаПлана(Форма, Знач ИмяКроссТаблицы, ОповещениеОбновленияИнтерфейса) Экспорт 
	
	Объект = Форма.Объект;
	Объект.НачалоПериода = НачалоМесяца(Объект.НачалоПериода);
	Объект.ОкончаниеПериода = КонецМесяца(Объект.ОкончаниеПериода);
	
	//ПланированиеКлиентСервер.УстановитьНачалоОкончаниеПериодаПлана(Объект.Периодичность, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	Если ПланированиеКлиентСервер.НеобходимоОбновитьИнтерфейс(Объект, Форма, "РеквизитыДоИзменения") Тогда
		
		КроссТаблица = Форма[ИмяКроссТаблицы];
		Если Объект.КроссТаблица
			И КроссТаблица.ПолучитьЭлементы().Количество() > 0
			И Форма.Периоды.НайтиСтроки(Новый Структура("Активная", Истина)).Количество() > 0 Тогда
			ЗадаватьВопрос = Ложь;
			
			Если Форма["РеквизитыДоИзменения"].НачалоПериода <> Объект.НачалоПериода Тогда
				//И Объект.НачалоПериода > Форма["РеквизитыДоИзменения"].НачалоПериода Тогда
				ЗадаватьВопрос = Истина;
			КонецЕсли; 
			
			Если Форма["РеквизитыДоИзменения"].ОкончаниеПериода <> Объект.ОкончаниеПериода Тогда
				//И Объект.ОкончаниеПериода < Форма["РеквизитыДоИзменения"].ОкончаниеПериода Тогда
				ЗадаватьВопрос = Истина;
			КонецЕсли;
			
			Если ЗадаватьВопрос Тогда
				Кнопки = Новый СписокЗначений;
				Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Очистить таблицу'"));
				Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Отменить изменение периода'"));
				ТекстВопроса = НСтр("ru='Изменение периода плана приведет к удалению данных в таблице потребностей. Очистить таблицу?'");
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Форма", Форма);
				ДополнительныеПараметры.Вставить("ИмяКроссТаблицы", ИмяКроссТаблицы);
				ДополнительныеПараметры.Вставить("ОповещениеОбновленияИнтерфейса", ОповещениеОбновленияИнтерфейса);
				Оповещение = Новый ОписаниеОповещения("ПриИзмененииПериодаПланаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
				
				ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(ОповещениеОбновленияИнтерфейса);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка изменения периода плана на основе пользовательского выбора
//
// Параметры:
// Результат 				- выбранный пользователем вариант ответа.
// ДополнительныеПараметры 	- структура с дополнительными параметрами (по умолчанию = Неопределено).
//	
Процедура ПриИзмененииПериодаПланаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
 	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ДополнительныеПараметры.Форма[ДополнительныеПараметры.ИмяКроссТаблицы].ПолучитьЭлементы().Очистить();
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОбновленияИнтерфейса);
	
	Иначе
	
		ПланированиеКлиентСервер.ВосстановитьЗначенияИзПроверяемыхРеквизитов(
			ДополнительныеПараметры.Форма.Объект, 
			ДополнительныеПараметры.Форма, 
			"РеквизитыДоИзменения", 
			"Периодичность, НачалоПериода, ОкончаниеПериода");
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
